app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def show_movies_with_same_director
    id = params[:id]
    @movie = Movie.find(id)

    begin
      @movies = Movie.find_with_same_director(id)